{"keras_version": "2.0.8", "config": [{"config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-33-8282dcd10df7>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "conv2d_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "filters": 16}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}