{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-8282dcd10df7>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "arguments": {}, "output_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "bias_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "padding": "valid", "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "padding": "valid", "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "padding": "valid", "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 500, "name": "dense_1", "activation": "elu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 100, "name": "dense_2", "activation": "elu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 20, "name": "dense_3", "activation": "elu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 1, "name": "dense_4", "activation": "linear"}}], "keras_version": "2.0.8", "backend": "tensorflow"}