{"keras_version": "2.0.8", "config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-34-8282dcd10df7>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 16, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_constraint": null, "name": "conv2d_1", "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_constraint": null, "name": "conv2d_3", "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "elu", "units": 500, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "elu", "units": 100, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "elu", "units": 20, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_4", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}