{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 16, "activation": "elu", "batch_input_shape": [null, 32, 128, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "activation": "elu", "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "activation": "elu", "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}]}