{"config": {"name": "model_1", "input_layers": [["lambda_1_input", 0, 0]], "layers": [{"name": "lambda_1_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "lambda_1_input", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32"}}, {"name": "lambda_2", "inbound_nodes": [[["lambda_1_input", 0, 0, {}]]], "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {"parts": 2, "idx": 0}, "function_type": "lambda", "name": "lambda_2", "trainable": true, "output_shape": [64, 64, 3], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s\u0096\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0000\u0000d\u0001\u0000\u0085\u0002\u0000\u0019|\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0000\u0000d\u0001\u0000\u0085\u0002\u0000\u0019|\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019d\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S)\u0004N\u00e9\u0001\u0000\u0000\u0000\u00da\u0004axis\u00e9\u0000\u0000\u0000\u0000)\u0004\u00da\u0002tf\u00da\u0005shape\u00da\u0006concat\u00da\u0005slice)\u0007\u00da\u0004data\u00da\u0003idx\u00da\u0005partsr\u0005\u0000\u0000\u0000\u00da\u0004size\u00da\u0006stride\u00da\u0005start\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-bfa3135a70a2>\u00da\tget_slice\n\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u00013\u00017\u0001\n\u0001", null, null]}}, {"name": "lambda_3", "inbound_nodes": [[["lambda_1_input", 0, 0, {}]]], "class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {"parts": 2, "idx": 1}, "function_type": "lambda", "name": "lambda_3", "trainable": true, "output_shape": [64, 64, 3], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s\u0096\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0000\u0000d\u0001\u0000\u0085\u0002\u0000\u0019|\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0004\u0000t\u0000\u0000j\u0002\u0000|\u0003\u0000d\u0000\u0000d\u0001\u0000\u0085\u0002\u0000\u0019|\u0002\u0000\u001a|\u0003\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019d\u0003\u0000\u0014g\u0002\u0000d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001}\u0005\u0000|\u0005\u0000|\u0001\u0000\u0014}\u0006\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000|\u0006\u0000|\u0004\u0000\u0083\u0003\u0000S)\u0004N\u00e9\u0001\u0000\u0000\u0000\u00da\u0004axis\u00e9\u0000\u0000\u0000\u0000)\u0004\u00da\u0002tf\u00da\u0005shape\u00da\u0006concat\u00da\u0005slice)\u0007\u00da\u0004data\u00da\u0003idx\u00da\u0005partsr\u0005\u0000\u0000\u0000\u00da\u0004size\u00da\u0006stride\u00da\u0005start\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-bfa3135a70a2>\u00da\tget_slice\n\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u00013\u00017\u0001\n\u0001", null, null]}}, {"name": "sequential_1", "inbound_nodes": [[["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]]], "class_name": "Sequential", "config": [{"config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "function_type": "lambda", "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-78d862541949>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"use_bias": true, "activation": "elu", "kernel_size": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "activation": "elu", "kernel_size": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "activation": "elu", "kernel_size": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "elu", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "units": 500, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "elu", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "units": 100, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "elu", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "units": 20, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias_constraint": null, "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, {"name": "concatenate_1", "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 0, "trainable": true}}], "output_layers": [["concatenate_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.8"}