{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 32, 128, 3], "trainable": true, "name": "lambda_1", "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-31-10609fc1d0fe>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "elu", "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "units": 500, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "elu", "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "units": 100, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "elu", "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "units": 20, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "bias_constraint": null}}]}