{"config": [{"config": {"arguments": {}, "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "output_shape": null, "dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-34-8282dcd10df7>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "filters": 16, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "filters": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 500, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 100, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 20, "kernel_regularizer": null, "trainable": true, "name": "dense_3", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}